// <!-- подменять на текст тему  -->
const themeMap = {
    1: "Авто",
    2: "Бизнес",
    3: "Дизайн",
    4: "Животные",
    5: "ЖЦА 30+",
    6: "Здоровье",
    7: "Знакомство и общение",
    8: "Игры",
    9: "IT",
    10: "Культура",
    11: "Кино",
    12: "Кулинария",
    13: "Литература",
    14: "Мода и красота",
    15: "Молодежные до 18",
    16: "МЦА 30+",
    17: "Наука и факты",
    18: "Недвижимость",
    19: "Новости и сми",
    20: "Образование",
    21: "Объявления",
    22: "Политика",
    23: "Природа",
    24: "Психология",
    25: "Развлечения",
    26: "Регион. порталы",
    27: "Религия",
    28: "Ремонт",
    29: "Работа",
    30: "Семья",
    31: "Спорт",
    32: "Товары и услуги",
    33: "Туризм",
    34: "Фото",
    35: "Хобби",
    36: "Эзотерика",
    37: "Эротика",
    38: "Юмор",
    39: "Другое",
    40: "Фан группы",
    41: "Крипта/NFT"
};

const themeSpan = document.getElementById("theme-value");
const themeId = Number(themeSpan.textContent);

if (themeMap[themeId]) {
themeSpan.textContent = themeMap[themeId];
} else {
themeSpan.textContent = "Неизвестная тема";
}